Revit 2027 API
DistanceMeasuredFrom Enumeration
 Indicates if the distance is measured from the top or bottom of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DistanceMeasuredFrom
Public Enumeration DistanceMeasuredFrom
public enum class DistanceMeasuredFrom
type DistanceMeasuredFrom
Members
Member name | Value | Description
Base | 0 |  From bottom.
Top | 1 |  From top.
See Also
Reference
Autodesk.Revit.DB Namespace